{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "facebook/opt-2.7b",
  "beta1": 0.85,
  "beta2": 0.85,
  "bias": "none",
  "corda_config": null,
  "deltaT": 10,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "init_r": 12,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "orth_reg_weight": 0.5,
  "peft_type": "ADALORA",
  "r": 8,
  "rank_pattern": null,
  "revision": null,
  "target_modules": [
    "v_proj",
    "q_proj"
  ],
  "target_r": 8,
  "task_type": "CAUSAL_LM",
  "tfinal": 400,
  "tinit": 50,
  "total_step": 500,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}